kwagyeman/micropython/ports/stm32/sdcard.c
// A board can support UHS-I mode (1.8V signalling) on UHS-I capable SD cards by defining:
//   MICROPY_HW_SDCARD_VSELECT_PIN - output pin that switches the SD bus I/O rail (and the
//     corresponding MCU I/O voltage domain) between 3.3V (low) and 1.8V (high)
//   MICROPY_HW_SDCARD_RESET_PIN - active-low output pin controlling SD card VDD; it is also
//     sampled at startup to detect whether the hardware supports UHS-I (it reads high if so)
// and optionally:
//   MICROPY_HW_SDCARD_UHS_SWITCH_PATTERN - CMD6 pattern selecting the UHS-I speed mode
//   MICROPY_HW_SDCARD_UHS_CLK_DIV - SDMMC clock divider to use after the speed switch
#if defined(MICROPY_HW_SDCARD_VSELECT_PIN) && defined(MICROPY_HW_SDCARD_RESET_PIN)
#define SDCARD_ENABLE_UHS1 (1)
#if !defined(USE_SD_TRANSCEIVER) || USE_SD_TRANSCEIVER == 0
#error "UHS-I support requires USE_SD_TRANSCEIVER=1 in the HAL configuration"
#endif
#ifndef MICROPY_HW_SDCARD_UHS_SWITCH_PATTERN
#define MICROPY_HW_SDCARD_UHS_SWITCH_PATTERN SDMMC_SDR50_SWITCH_PATTERN
#endif
#ifndef MICROPY_HW_SDCARD_UHS_CLK_DIV
#define MICROPY_HW_SDCARD_UHS_CLK_DIV (1)
#endif
#if MICROPY_HW_SDCARD_SDMMC == 2
#define SDCARD_DLYB DLYB_SDMMC2
#else
#define SDCARD_DLYB DLYB_SDMMC1
#endif
#if defined(STM32N6)
// The SD bus pins sit in a switchable VDDIO power domain; a board can select which
// one with MICROPY_HW_SDCARD_VDDIO (2-5), defaulting to the domain that the used
// SDMMC's default pins are in.  The matching HSLV_VDDIOx OTP fuse must be set for
// the 1.8V pad voltage range to be selectable.
#ifndef MICROPY_HW_SDCARD_VDDIO
#if MICROPY_HW_SDCARD_SDMMC == 2
#define MICROPY_HW_SDCARD_VDDIO (5)
#else
#define MICROPY_HW_SDCARD_VDDIO (4)
#endif
#endif
#if MICROPY_HW_SDCARD_VDDIO == 2
#define SDCARD_VDDIO_SET_RANGE LL_PWR_SetVddIO2VoltageRange
#define SDCARD_VDDIO_GET_RANGE LL_PWR_GetVddIO2VoltageRange
#elif MICROPY_HW_SDCARD_VDDIO == 3
#define SDCARD_VDDIO_SET_RANGE LL_PWR_SetVddIO3VoltageRange
#define SDCARD_VDDIO_GET_RANGE LL_PWR_GetVddIO3VoltageRange
#elif MICROPY_HW_SDCARD_VDDIO == 4
#define SDCARD_VDDIO_SET_RANGE LL_PWR_SetVddIO4VoltageRange
#define SDCARD_VDDIO_GET_RANGE LL_PWR_GetVddIO4VoltageRange
#elif MICROPY_HW_SDCARD_VDDIO == 5
#define SDCARD_VDDIO_SET_RANGE LL_PWR_SetVddIO5VoltageRange
#define SDCARD_VDDIO_GET_RANGE LL_PWR_GetVddIO5VoltageRange
#else
#error "Invalid MICROPY_HW_SDCARD_VDDIO"
#endif
#endif
#else
#define SDCARD_ENABLE_UHS1 (0)
#endif

#define PYB_SDMMC_FLAG_SD       (0x01)
#define PYB_SDMMC_FLAG_MMC      (0x02)
#define PYB_SDMMC_FLAG_ACTIVE   (0x04)

static uint8_t pyb_sdmmc_flags;

#if SDCARD_ENABLE_UHS1
// Set if the hardware supports UHS-I, detected at startup via MICROPY_HW_SDCARD_RESET_PIN.
static bool sdcard_uhs_capable;
#endif

#define TIMEOUT_MS 30000

// TODO: I think that as an optimization, we can allocate these dynamically
//       if an sd card is detected. This will save approx 260 bytes of RAM
//       when no sdcard was being used.
static union {
    SD_HandleTypeDef sd;
    #if MICROPY_HW_ENABLE_MMCARD
    MMC_HandleTypeDef mmc;
    #endif
} sdmmc_handle;

static void sdcard_pin_config(void) {
    // configure SD GPIO
    // we do this here an not in HAL_SD_MspInit because it apparently
    // makes it more robust to have the pins always pulled high
    // Note: the mp_hal_pin_config function will configure the GPIO in
    // fast mode which can do up to 50MHz.  This should be plenty for SDIO
    // which clocks up to 25MHz maximum.
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_CK, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_CK);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_CMD, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_CMD);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D0, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D0);
    #if MICROPY_HW_SDCARD_BUS_WIDTH >= 4
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D1, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D1);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D2, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D2);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D3, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D3);
    #if MICROPY_HW_SDCARD_BUS_WIDTH == 8
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D4, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D4);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D5, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D5);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D6, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D6);
    mp_hal_pin_config_alt_static(MICROPY_HW_SDCARD_D7, MP_HAL_PIN_MODE_ALT, MP_HAL_PIN_PULL_UP, STATIC_AF_SDCARD_D7);
    #endif
    #endif

    #if SDCARD_ENABLE_UHS1
    if (sdcard_uhs_capable) {
        // UHS-I bus rates need the fastest GPIO drive setting.
        mp_hal_pin_config_speed(MICROPY_HW_SDCARD_CK, MP_HAL_PIN_SPEED_VERY_HIGH);
        mp_hal_pin_config_speed(MICROPY_HW_SDCARD_CMD, MP_HAL_PIN_SPEED_VERY_HIGH);
        mp_hal_pin_config_speed(MICROPY_HW_SDCARD_D0, MP_HAL_PIN_SPEED_VERY_HIGH);
        #if MICROPY_HW_SDCARD_BUS_WIDTH >= 4
        mp_hal_pin_config_speed(MICROPY_HW_SDCARD_D1, MP_HAL_PIN_SPEED_VERY_HIGH);
        mp_hal_pin_config_speed(MICROPY_HW_SDCARD_D2, MP_HAL_PIN_SPEED_VERY_HIGH);
        mp_hal_pin_config_speed(MICROPY_HW_SDCARD_D3, MP_HAL_PIN_SPEED_VERY_HIGH);
        #endif
    }
    #endif
}

void sdcard_init(void) {
    // Set SD/MMC to no mode and inactive
    pyb_sdmmc_flags = 0;

    #if SDCARD_ENABLE_UHS1
    // Sample the SD reset pin to detect UHS-I capable hardware: it reads high when
    // the UHS-I power switch circuitry is present.
    mp_hal_pin_config(MICROPY_HW_SDCARD_RESET_PIN, MP_HAL_PIN_MODE_INPUT, MP_HAL_PIN_PULL_NONE, 0);
    sdcard_uhs_capable = mp_hal_pin_read(MICROPY_HW_SDCARD_RESET_PIN);
    if (sdcard_uhs_capable) {
        // Take over the card's power enable (keeping it powered) and select 3.3V signalling.
        mp_hal_pin_high(MICROPY_HW_SDCARD_RESET_PIN);
        mp_hal_pin_config(MICROPY_HW_SDCARD_RESET_PIN, MP_HAL_PIN_MODE_OUTPUT, MP_HAL_PIN_PULL_NONE, 0);
        mp_hal_pin_low(MICROPY_HW_SDCARD_VSELECT_PIN);
        mp_hal_pin_config(MICROPY_HW_SDCARD_VSELECT_PIN, MP_HAL_PIN_MODE_OUTPUT, MP_HAL_PIN_PULL_NONE, 0);
    }
    #endif

    sdcard_pin_config();

    // configure the SD card detect pin
    // we do this here so we can detect if the SD card is inserted before powering it on
    #if defined(MICROPY_HW_SDCARD_DETECT_PIN)
    mp_hal_pin_config(MICROPY_HW_SDCARD_DETECT_PIN, MP_HAL_PIN_MODE_INPUT, MICROPY_HW_SDCARD_DETECT_PULL, 0);
    #endif
}

void sdcard_select_sd(void) {
    pyb_sdmmc_flags |= PYB_SDMMC_FLAG_SD;
}

void sdcard_select_mmc(void) {
    pyb_sdmmc_flags |= PYB_SDMMC_FLAG_MMC;
}

static void sdmmc_msp_init(void) {
    // enable SDIO clock
    SDMMC_CLK_ENABLE();

