kwagyeman/micropython/ports/stm32/sdcard.c
    #if defined(STM32H7) || defined(STM32N6)
    // Reset SDMMC
    SDMMC_FORCE_RESET();
    SDMMC_RELEASE_RESET();
    #endif

    // NVIC configuration for SDIO interrupts
    NVIC_SetPriority(SDMMC_IRQn, IRQ_PRI_SDIO);
    HAL_NVIC_EnableIRQ(SDMMC_IRQn);

    // GPIO have already been initialised by sdcard_init
}

void sdmmc_msp_deinit(void) {
    HAL_NVIC_DisableIRQ(SDMMC_IRQn);
    SDMMC_CLK_DISABLE();
}

#if MICROPY_HW_ENABLE_SDCARD
void HAL_SD_MspInit(SD_HandleTypeDef *hsd) {
    sdmmc_msp_init();
}

void HAL_SD_MspDeInit(SD_HandleTypeDef *hsd) {
    sdmmc_msp_deinit();
}
#endif

#if MICROPY_HW_ENABLE_MMCARD
void HAL_MMC_MspInit(MMC_HandleTypeDef *hsd) {
    sdmmc_msp_init();
}

void HAL_MMC_MspDeInit(MMC_HandleTypeDef *hsd) {
    sdmmc_msp_deinit();
}
#endif

bool sdcard_is_present(void) {
    #if MICROPY_HW_ENABLE_MMCARD
    if (pyb_sdmmc_flags & PYB_SDMMC_FLAG_MMC) {
        return false;
    }
    #endif
    #if defined(MICROPY_HW_SDCARD_DETECT_PIN)
    return mp_hal_pin_read(MICROPY_HW_SDCARD_DETECT_PIN) == MICROPY_HW_SDCARD_DETECT_PRESENT;
    #else
    return true;
    #endif
}

#if MICROPY_HW_ENABLE_SDCARD
static void sdcard_reset_periph();

#if SDCARD_ENABLE_UHS1

// Switch the SD bus I/O voltage.  Called by the HAL during the CMD11 voltage switch
// sequence (with the bus clock stopped), and by this driver to restore 3.3V signalling.
void HAL_SD_DriveTransceiver_1_8V_Callback(FlagStatus status) {
    if (status == SET) {
        // The card acknowledged the switch: change the bus I/O rail to 1.8V and then
        // update the MCU pad voltage range to match the new rail voltage.
        mp_hal_pin_high(MICROPY_HW_SDCARD_VSELECT_PIN);
        mp_hal_delay_ms(1);
        #if defined(STM32N6)
        SDCARD_VDDIO_SET_RANGE(LL_PWR_VDDIO_VOLTAGE_RANGE_1V8);
        #endif
    } else {
        // Restore the pad voltage range first (a 1.8V pad range on a 3.3V rail can
        // damage the device), then switch the bus I/O rail back to 3.3V.
        #if defined(STM32N6)
        SDCARD_VDDIO_SET_RANGE(LL_PWR_VDDIO_VOLTAGE_RANGE_3V3);
        #endif
        mp_hal_pin_low(MICROPY_HW_SDCARD_VSELECT_PIN);
    }
}

static void sdcard_power_cycle(void) {
    // Return the bus to 3.3V signalling.
    HAL_SD_DriveTransceiver_1_8V_Callback(RESET);

    // Drive the SD bus pins low so the card is not back-powered via its I/O pins
    // while its supply is off.
    static const mp_hal_pin_obj_t bus_pins[] = {
        MICROPY_HW_SDCARD_CK, MICROPY_HW_SDCARD_CMD, MICROPY_HW_SDCARD_D0,
        #if MICROPY_HW_SDCARD_BUS_WIDTH >= 4
        MICROPY_HW_SDCARD_D1, MICROPY_HW_SDCARD_D2, MICROPY_HW_SDCARD_D3,
        #endif
    };
    for (size_t i = 0; i < MP_ARRAY_SIZE(bus_pins); ++i) {
        mp_hal_pin_low(bus_pins[i]);
        mp_hal_pin_config(bus_pins[i], MP_HAL_PIN_MODE_OUTPUT, MP_HAL_PIN_PULL_NONE, 0);
    }

    // Power cycle the SD card: its supply must fall below 0.5V for at least 1ms.
    mp_hal_pin_low(MICROPY_HW_SDCARD_RESET_PIN);
    mp_hal_delay_ms(20);
    mp_hal_pin_high(MICROPY_HW_SDCARD_RESET_PIN);
    mp_hal_delay_ms(10);

    // Restore the SD bus pins.
    sdcard_pin_config();
}

// Perform a CMD6 SWITCH_FUNC transaction, reading back the 64-byte switch status.
// The HAL's own CMD6 helpers arm the data path via DCTRL.DTEN without linking it to
// the command (CMDTRANS), which hangs on this SDMMC peripheral, so the transfer is
// done here using the same command-transfer mechanism as regular block reads.
static uint32_t sdcard_cmd6_switch(uint32_t arg, uint32_t *status) {
    SDMMC_TypeDef *sdmmc = sdmmc_handle.sd.Instance;

    uint32_t errorstate = SDMMC_CmdBlockLength(sdmmc, 64);
    if (errorstate != HAL_SD_ERROR_NONE) {
        return errorstate;
    }

    SDMMC_DataInitTypeDef config = {
        .DataTimeOut = 6250000, // 250ms at the 25MHz switching clock
        .DataLength = 64,
        .DataBlockSize = SDMMC_DATABLOCK_SIZE_64B,
        .TransferDir = SDMMC_TRANSFER_DIR_TO_SDMMC,
        .TransferMode = SDMMC_TRANSFER_MODE_BLOCK,
        .DPSM = SDMMC_DPSM_DISABLE,
    };
    (void)SDMMC_ConfigData(sdmmc, &config);
    __SDMMC_CMDTRANS_ENABLE(sdmmc);

    errorstate = SDMMC_CmdSwitch(sdmmc, arg);

    if (errorstate == HAL_SD_ERROR_NONE) {
        // The 64-byte status block fits entirely in the SDMMC FIFO, and takes well
        // under a millisecond to arrive at the 25MHz switching clock, so wait out
        // the transfer and then drain the FIFO unconditionally.  The status flags
        // cannot be used to pace the drain: after the 1.8V switch the data path
        // status reads stale until the FIFO is accessed, so the flag-driven receive
        // loops that the HAL uses deadlock here.
        mp_hal_delay_ms(2);
        for (int i = 0; i < 16; ++i) {
            status[i] = SDMMC_ReadFIFO(sdmmc);
        }
        // The status refreshes some time after the FIFO accesses above, so give it
        // a grace period before believing what it says.
        uint32_t sta;
        for (int i = 0; ; ++i) {
            sta = sdmmc->STA;
            if (sta & (SDMMC_FLAG_DATAEND | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DCRCFAIL |
                       SDMMC_FLAG_RXOVERR)) {
                break;
            }
            if (i >= 100) {
                break;
            }
            mp_hal_delay_us(100);
        }
        if (sta & (SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_RXOVERR)) {
            errorstate = SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
        } else if (!(sta & SDMMC_FLAG_DATAEND)) {
            // The card did not send the status block.
            sdmmc->DCTRL = 0;
            errorstate = SDMMC_ERROR_TIMEOUT;
        }
    }

    __SDMMC_CMDTRANS_DISABLE(sdmmc);
    __SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);

    return errorstate;
}

#endif // SDCARD_ENABLE_UHS1

static HAL_StatusTypeDef sdmmc_init_sd_bus(bool uhs) {
    (void)uhs;
    sdcard_reset_periph();

    // SD device interface configuration
    sdmmc_handle.sd.Instance = SDIO;
    sdmmc_handle.sd.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    #if !defined(STM32H5) && !defined(STM32H7) && !defined(STM32N6)
    sdmmc_handle.sd.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    #endif
    sdmmc_handle.sd.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_ENABLE;
    sdmmc_handle.sd.Init.BusWide = SDIO_BUS_WIDE_1B;
    sdmmc_handle.sd.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_ENABLE;
    sdmmc_handle.sd.Init.ClockDiv = SDIO_TRANSFER_CLK_DIV;
    #if SDCARD_ENABLE_UHS1
    if (uhs) {
        // Run card identification and the 1.8V voltage switch at 25MHz; the clock is
        // raised to the UHS-I rate after the speed switch below.
        sdmmc_handle.sd.Init.TranceiverPresent = SDMMC_TRANSCEIVER_PRESENT;
        sdmmc_handle.sd.Init.ClockDiv = SDMMC_NSPEED_CLK_DIV;
        // Keep the bus clock free-running in UHS-I mode (matching the ST BSPs); with
        // clock power saving enabled the voltage switch and CMD6 sequences stall.
        sdmmc_handle.sd.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    } else {
        sdmmc_handle.sd.Init.TranceiverPresent = SDMMC_TRANSCEIVER_NOT_PRESENT;
    }
    #endif

