kwagyeman/micropython/ports/stm32/sdcard.c
    // init the SD interface, with retry if it's not ready yet
    HAL_StatusTypeDef status;
    for (int retry = 10; (status = HAL_SD_Init(&sdmmc_handle.sd)) != HAL_OK; retry--) {
        #if SDCARD_ENABLE_UHS1
        if (uhs) {
            // Don't retry a failed UHS-I init here: the card may be stuck mid voltage
            // switch and needs a power cycle, which the caller takes care of.
            return status;
        }
        #endif
        if (retry == 0) {
            return status;
        }
        mp_hal_delay_ms(50);
    }

    #if MICROPY_HW_SDCARD_BUS_WIDTH >= 4
    // configure the SD bus width for 4/8-bit wide operation
    status = HAL_SD_ConfigWideBusOperation(&sdmmc_handle.sd, SDIO_BUS_WIDE_VALUE);
    if (status != HAL_OK) {
        HAL_SD_DeInit(&sdmmc_handle.sd);
        return status;
    }
    #endif

    #if SDCARD_ENABLE_UHS1
    if (uhs) {
        bool uhs_active = sdmmc_handle.sd.SdCard.CardSpeed == CARD_ULTRA_HIGH_SPEED;
        #if defined(STM32N6)
        if (uhs_active) {
            // Verify that the pad voltage range switch took effect: without the
            // matching HSLV_VDDIOx OTP fuse the VRSEL write is silently ignored and
            // the pads remain in 3.3V mode, which passes the (slow) initialisation
            // but fails at UHS-I bus rates.  Fail the attempt here so the caller
            // power cycles the card and falls back to 3.3V operation.
            if (SDCARD_VDDIO_GET_RANGE() != LL_PWR_VDDIO_VOLTAGE_RANGE_1V8) {
                HAL_SD_DeInit(&sdmmc_handle.sd);
                return HAL_ERROR;
            }
        }
        #endif
        uint32_t pattern;
        uint32_t clk_div;
        if (uhs_active) {
            // The card accepted the 1.8V voltage switch during init: select the UHS-I
            // speed mode.
            pattern = MICROPY_HW_SDCARD_UHS_SWITCH_PATTERN;
            clk_div = MICROPY_HW_SDCARD_UHS_CLK_DIV;
        } else {
            // The card remained at 3.3V signalling: select high speed mode (SDR25).
            pattern = SDMMC_SDR25_SWITCH_PATTERN;
            clk_div = SDIO_TRANSFER_CLK_DIV;
        }
        uint32_t switch_status[16];
        uint32_t errorstate = sdcard_cmd6_switch(pattern, switch_status);
        if (errorstate == HAL_SD_ERROR_NONE
            && (((uint8_t *)switch_status)[16] & 0xf) != (pattern & 0xf)) {
            // The card did not switch to the requested speed mode.
            errorstate = SDMMC_ERROR_UNSUPPORTED_FEATURE;
        }
        if (errorstate != HAL_SD_ERROR_NONE) {
            HAL_SD_DeInit(&sdmmc_handle.sd);
            return HAL_ERROR;
        }
        if (uhs_active) {
            // Sample the incoming data on the feedback clock, via the delay block.
            MODIFY_REG(SDIO->CLKCR, SDMMC_CLKCR_SELCLKRX, SDMMC_CLKCR_SELCLKRX_1);
            LL_DLYB_Enable(SDCARD_DLYB);
            SDIO->CLKCR |= SDMMC_CLKCR_BUSSPEED;
        }
        // Raise the bus clock to its final rate.
        sdmmc_handle.sd.Init.ClockDiv = clk_div;
        MODIFY_REG(SDIO->CLKCR, SDMMC_CLKCR_CLKDIV, clk_div);
    }
    #endif

    return HAL_OK;
}

static HAL_StatusTypeDef sdmmc_init_sd(void) {
    #if SDCARD_ENABLE_UHS1
    if (sdcard_uhs_capable) {
        // Try to bring the card up in UHS-I mode.  Power cycle the card before each
        // attempt so it is in a known 3.3V state: a warm reset can leave the card in
        // 1.8V mode (in which case it will not advertise 1.8V support), and a failed
        // attempt can leave it stuck mid voltage switch.
        for (int attempt = 0; attempt < 2; ++attempt) {
            sdcard_power_cycle();
            HAL_StatusTypeDef status = sdmmc_init_sd_bus(true);
            if (status == HAL_OK) {
                return HAL_OK;
            }
        }
        // Fall back to a plain 3.3V init.
        sdcard_power_cycle();
    }
    #endif
    return sdmmc_init_sd_bus(false);
}
#endif

#if MICROPY_HW_ENABLE_MMCARD
static HAL_StatusTypeDef sdmmc_init_mmc(void) {
    // MMC device interface configuration
    sdmmc_handle.mmc.Instance = SDIO;
    sdmmc_handle.mmc.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    #ifndef STM32H7
    sdmmc_handle.mmc.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    #endif
    sdmmc_handle.mmc.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_ENABLE;
    sdmmc_handle.mmc.Init.BusWide = SDIO_BUS_WIDE_1B;
    sdmmc_handle.mmc.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    sdmmc_handle.mmc.Init.ClockDiv = SDIO_TRANSFER_CLK_DIV;

    // Init the SDIO interface
    HAL_StatusTypeDef status = HAL_MMC_Init(&sdmmc_handle.mmc);
    if (status != HAL_OK) {
        return status;
    }

    #ifdef MICROPY_HW_MMCARD_LOG_BLOCK_NBR
    // A board can override the number of logical blocks (card capacity) if needed.
    // This is needed when a card is high capacity because the extended CSD command
    // is not supported by the current version of the HAL.
    sdmmc_handle.mmc.MmcCard.LogBlockNbr = MICROPY_HW_MMCARD_LOG_BLOCK_NBR;
    #endif

    #if MICROPY_HW_SDCARD_BUS_WIDTH >= 4
    // Configure the SDIO bus width for 4/8-bit wide operation
    #ifdef STM32F7
    sdmmc_handle.mmc.Init.ClockBypass = SDIO_CLOCK_BYPASS_ENABLE;
    #endif
    status = HAL_MMC_ConfigWideBusOperation(&sdmmc_handle.mmc, SDIO_BUS_WIDE_VALUE);
    if (status != HAL_OK) {
        HAL_MMC_DeInit(&sdmmc_handle.mmc);
        return status;
    }
    #endif

    return HAL_OK;
}
#endif

bool sdcard_power_on(void) {
    if (pyb_sdmmc_flags & PYB_SDMMC_FLAG_ACTIVE) {
        return true;
    }

    #ifdef MICROPY_BOARD_SDCARD_POWER
    MICROPY_BOARD_SDCARD_POWER
    #endif

    HAL_StatusTypeDef status = HAL_ERROR;
    switch (pyb_sdmmc_flags) {
        #if MICROPY_HW_ENABLE_SDCARD
        case PYB_SDMMC_FLAG_SD:
            if (sdcard_is_present()) {
                status = sdmmc_init_sd();
            }
            break;
        #endif
        #if MICROPY_HW_ENABLE_MMCARD
        case PYB_SDMMC_FLAG_MMC:
            status = sdmmc_init_mmc();
            break;
        #endif
    }

    if (status == HAL_OK) {
        pyb_sdmmc_flags |= PYB_SDMMC_FLAG_ACTIVE;
        return true;
    } else {
        return false;
    }
}

